window.onload=function(){
	let ytdata={
		colort:"#dbb7d4",
		bgcolor:"#fdf9f9",
		img:["../img/prdo-1.png","../img/prdo-2.png"],
		product:[
			{title:"辛福究竟是什么？",
			content:["在一片茂盛的树林中，小鸟在枝头大声歌唱，温暖的阳光透过树枝缝隙从天上撒下来，照耀若每个生灵.一对男女在林间小路上手牵手，缓缓而行。窃窃私语，虽然不知他们在说些什么，但从他们快乐的神情看得出他们是幸福的.沉醉于爱悄中的人是幸福的，长长的人生旅途，有他(她)的陪伴，相互搀扶，还有什么比这更幸福呢?","幸福其实无确切的定义.其实，幸福是一种感觉，当你感觉到幸福时，幸福就来到了你的身边。"]},
			{
			title:"分享好茶，辛福分享",
			content:["BACK TEA钡堤果持著「分享好茶，幸福分享」的宗旨，以推广健康天然的饮食文化为目的，坚持以一致性的原则巩固饮品品质以标淮化的服务精神建立专业的服务形象，把最天然健康的饮品与最亲切的服务带给顾客。","Back Tea坝堤不只是个品牌，代表的是台湾的饮食文化的讲究，还有服务的热忱，如同我们的标语「分享好茶，幸福分享」。"]	
			}
			]
	};
	let jjdata={
		colort:"#9dce69",
		bgcolor:"#f8faea",
		img:["../img/prdo-3.png","../img/prdo-2.png"],
		product:[
			{title:"辛福究竟是什么？",
			content:["在一个用木头搭起的乡村学校里，破烂不堪的桌椅板凳和明显营养不良的孩子们，老师的衣服上打了数个补丁，老师叫他们练英语\"I am happy to go to school.。\"朗朗的读书声发自这阴暗的教室.虽然生活上贫乏。但从他们张张笑脸上。看得出他们的享受若学习的幸福，他们的精神上是无比幸福的","幸福其实无确切的定义.其实，幸福是一种感觉，当你感觉到幸福时，幸福就来到了你的身边。"]},
			{
			title:"分享好茶，辛福分享",
			content:["BACK TEA钡堤果持著「分享好茶，幸福分享」的宗旨，以推广健康天然的饮食文化为目的，坚持以一致性的原则巩固饮品品质以标淮化的服务精神建立专业的服务形象，把最天然健康的饮品与最亲切的服务带给顾客。","Back Tea坝堤不只是个品牌，代表的是台湾的饮食文化的讲究，还有服务的热忱，如同我们的标语「分享好茶，幸福分享」。"]	
			}
			]
	};
	let xcdata={
		colort:"#c5b2b4",
		bgcolor:"#f2eeee",
		img:["../img/prdo-4.png","../img/prdo-2.png"],
		product:[
			{title:"辛福究竟是什么？",
			content:["一个出了车祸的人躺在病床上，但却笑容满面.生最宝贵的是生命于是又有人问:“你出了车祸，现在在病床上，不痛苦吗?哪知那人正色道:“人大难中我还能有人生最宝贵的东西，不是幸福吗?”","幸福其实无确切的定义.其实，幸福是一种感觉，当你感觉到幸福时，幸福就来到了你的身边。"]},
			{
			title:"分享好茶，辛福分享",
			content:["BACK TEA钡堤果持著「分享好茶，幸福分享」的宗旨，以推广健康天然的饮食文化为目的，坚持以一致性的原则巩固饮品品质以标淮化的服务精神建立专业的服务形象，把最天然健康的饮品与最亲切的服务带给顾客。","Back Tea坝堤不只是个品牌，代表的是台湾的饮食文化的讲究，还有服务的热忱，如同我们的标语「分享好茶，幸福分享」。"]	
			}
			]
	};
	let bzdata={
		colort:"#ff5c68",
		bgcolor:"#fdf0f1",
		img:["../img/prdo-5.png","../img/prdo-2.png"],
		product:[
			{title:"辛福究竟是什么？",
			content:["虽然生活在贫困的乡村，没有城市的纷华多彩.但有清新的空气可呼吸.有美丽的野花可欣赏，有可爱的萤火虫在也望的星空闪辉，山间有清澈的小溪欢快地流消。周末可以和伙伴们在河边抓鱼。可以上山采野果，摘野花”一这是多么幸福美好的一种生活啊","幸福其实无确切的定义.其实，幸福是一种感觉，当你感觉到幸福时，幸福就来到了你的身边。"]},
			{
			title:"分享好茶，辛福分享",
			content:["BACK TEA钡堤果持著「分享好茶，幸福分享」的宗旨，以推广健康天然的饮食文化为目的，坚持以一致性的原则巩固饮品品质以标淮化的服务精神建立专业的服务形象，把最天然健康的饮品与最亲切的服务带给顾客。","Back Tea坝堤不只是个品牌，代表的是台湾的饮食文化的讲究，还有服务的热忱，如同我们的标语「分享好茶，幸福分享」。"]	
			}
			]
	};
	let wldata={
		colort:"#5d9d80",
		bgcolor:"#edf3f0",
		img:["../img/prdo-6.png","../img/prdo-2.png"],
		product:[
			{title:"辛福究竟是什么？",
			content:["那天，三姨回到家不用这么伤心嘛!满脸的沮丧.不用问，也知道她这次医疗考试没考过.我看见三姨这样伤心，就走过去安慰三姨，说:“三姨基风雨过后就是彩虹，你下次肯定会遇见彩虹啦!再说，失败是成功之母，你不先遇见它妈。怎么能遇见它儿子呢?”三姨听我这么一说，不由得年味一声笑了出来.瞬间，灰蒙蒙的天变得晴朗","幸福其实无确切的定义.其实，幸福是一种感觉，当你感觉到幸福时，幸福就来到了你的身边。"]},
			{
			title:"分享好茶，辛福分享",
			content:["BACK TEA钡堤果持著「分享好茶，幸福分享」的宗旨，以推广健康天然的饮食文化为目的，坚持以一致性的原则巩固饮品品质以标淮化的服务精神建立专业的服务形象，把最天然健康的饮品与最亲切的服务带给顾客。","Back Tea坝堤不只是个品牌，代表的是台湾的饮食文化的讲究，还有服务的热忱，如同我们的标语「分享好茶，幸福分享」。"]	
			}
			]
	};
	let bxdata={
		colort:"#dbb7d4",
		bgcolor:"#fdf9f9",
		img:["../img/prdo-1.png","../img/prdo-2.png"],
		product:[
			{title:"辛福究竟是什么？",
			content:["在一片茂盛的树林中，小鸟在枝头大声歌唱，温暖的阳光透过树枝缝隙从天上撒下来，照耀若每个生灵.一对男女在林间小路上手牵手，缓缓而行。窃窃私语，虽然不知他们在说些什么，但从他们快乐的神情看得出他们是幸福的.沉醉于爱悄中的人是幸福的，长长的人生旅途，有他(她)的陪伴，相互搀扶，还有什么比这更幸福呢?","幸福其实无确切的定义.其实，幸福是一种感觉，当你感觉到幸福时，幸福就来到了你的身边。"]},
			{
			title:"分享好茶，辛福分享",
			content:["BACK TEA钡堤果持著「分享好茶，幸福分享」的宗旨，以推广健康天然的饮食文化为目的，坚持以一致性的原则巩固饮品品质以标淮化的服务精神建立专业的服务形象，把最天然健康的饮品与最亲切的服务带给顾客。","Back Tea坝堤不只是个品牌，代表的是台湾的饮食文化的讲究，还有服务的热忱，如同我们的标语「分享好茶，幸福分享」。"]	
			}
			]
	};
	let mgdata={
		colort:"#f9ca00",
		bgcolor:"#fdf8e3",
		img:["../img/prdo-8.png","../img/prdo-2.png"],
		product:[
			{title:"辛福究竟是什么？",
			content:["一个人正在做实验，旁边记录着他失败的次数99，100。101….看着他疲惫但快乐的样子，有人不禁问道:\"你不累吗?\".当然\"他依旧是微笑着.\"那你还要做下去吗。面对这些失败。你不会难过吗.\"难过?怎么会呢只要我坚持，就一定回成功，而这些失败就是我的经验，我应该感谢上天给了我这么好的经历，给了我这么多经验才对呀!\"","幸福其实无确切的定义.其实，幸福是一种感觉，当你感觉到幸福时，幸福就来到了你的身边。"]},
			{
			title:"分享好茶，辛福分享",
			content:["BACK TEA钡堤果持著「分享好茶，幸福分享」的宗旨，以推广健康天然的饮食文化为目的，坚持以一致性的原则巩固饮品品质以标淮化的服务精神建立专业的服务形象，把最天然健康的饮品与最亲切的服务带给顾客。","Back Tea坝堤不只是个品牌，代表的是台湾的饮食文化的讲究，还有服务的热忱，如同我们的标语「分享好茶，幸福分享」。"]	
			}
			]
	};
	let productMain = document.getElementsByClassName("product-main")[0];
	let datafun=baidu.template('product-content');
	let data=[ytdata,jjdata,xcdata,bzdata,wldata,bxdata,mgdata];
	let smailAside = document.getElementsByClassName("smail-aside")[0].getElementsByTagName("li");
	productMain.innerHTML=datafun(data[0]);
	for(let i=0;i<smailAside.length;i++){
		smailAside[i].index=i;
		smailAside[i].onclick=function(){
			productMain.innerHTML=datafun(data[this.index]);
		}
	}
	
}
window.onscroll=function(){
		let top= document.documentElement.scrollTop || document.body.scrollTop; 
		let aside = document.getElementsByTagName("aside")[0];
		if(top>=755){
			aside.style.position="fixed";
			aside.style.top=0;
		}else{
			aside.style.position="relative";
		}
}
